OdDAI.daiErrorHandlerManager.removeHandler(OdSharedPtr&lt;OdDAI.daiErrorHandlerBase&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Removes an error handler from the collection of error handlers.
\param handlerToDelete       [in] Smart pointer to an error handler to remove.
\returns
true if successfully deleted from a collection of error handlers, false otherwise.

OdDAI.daiErrorHandlerManager.addHandler(OdSharedPtr&lt;OdDAI.daiErrorHandlerBase&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds an error handler to the collection of error handlers.
\param handlerToAdd       [in] Smart pointer to an error handler to add.
\returns
true if successfully pushed to a collection of error handlers, false otherwise.

OdDAI.daiErrorHandlerManager.errorQuery
\details
Queries the last error from the error stack.
This error is popped from the error stack after it's queried.
\returns
Error code as daiErrorId value.

OdDAI.daiErrorHandlerManager.log(System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Logs a given error.
\param minor              [in] Error code.
\param errorDescription   [in] Error description in a human-readable form.
\param functionId         [in] Pointer to a name of the function where an error is handled.

OdDAI.daiErrorHandlerManager.catchFunction
\details
A catch function for an exception. See the class description for more information.